In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
database = pd.read_excel("Company.xlsx")
database.head(3)

,id,name,role,salary,age,gender,alive,department,alone,phonenumber,city,state,single,education,loanstatus,Isadmin,investement,yearloadbill
0,1,Nathan Bolton,Manager,43056,45,Other,No,Support,No,4579240482,Jordanbury,Wisconsin,No,High School,Rejected,True,17317,50907
1,2,Andrew Doyle,Developer,79400,60,Other,Yes,IT,No,6881176726,Port Markfort,Texas,No,PhD,Approved,False,2091,106120
2,3,Rebecca Wiley,Designer,49856,21,Other,No,Finance,Yes,+1-820-049-2423,New Veronica,Alabama,Yes,Bachelors,Pending,True,49187,88174

In [4]:
import scipy.stats as st

In [7]:
stats: int = st.t.ppf(0.05, 24)
print("The critical value is: ", stats)

The critical value is:  -1.7108820799094282

In [8]:
t_table: int = st.t.ppf(1-0.05, 24)
print("The critical value is: ", t_table)

The critical value is:  1.7108820799094275

In [10]:
t_calculated: int = (80 - 75) /(np.sqrt((25/20)+(26/20)))
print("The critical value is: ", t_calculated)

The critical value is:  3.1311214554257476

In [11]:
row_1 = np.array([40, 45, 25, 10])
row_2 = np.array([35, 30, 20, 30])

In [13]:
sum_r1 = np.sum(row_1)
sum_r2 = np.sum(row_2)
print("Sum of row 1 is: ", sum_r1)
print("Sum of row 2 is: ", sum_r2)

Sum of row 1 is:  120
Sum of row 2 is:  115

In [14]:
sum_col = row_1 + row_2
print("Sum of column is: ", sum_col)

Sum of column is:  [75 75 45 40]

In [17]:
sum_of_row = np.array([sum_r1 , sum_r2])

In [20]:
exp = []
for i in sum_of_row:
    for j in sum_col:
        value = (i * j)/ 235
        exp.append(value)